users-ms/users-ms/app/models/companies_head_hunter.rb

    def accept!
        self.status = :accepted
        self.save!
---
UPDATE "companies_head_hunters" SET "status" = 1, "updated_at" = '2020-05-24 05:15:59.978687' WHERE "companies_head_hunters"."id" = 1