users-ms/users-ms/app/models/head_hunters_user.rb

UPDATE "head_hunters_users" SET "status" = 1, "updated_at" = '2020-05-24 21:42:59.329719' WHERE "head_hunters_users"."id" = 1
---
    def accept!
        self.status = :accepted
        self.save!