users-ms/users-ms/app/controllers/assignments_controller.rb

    def request_head_hunter
        head_hunter_id = params.require :head_hunter_id
        puts @decoded_user.inspect

        raise AppException::InvalidRole if @decoded_user[:type] != "user" && @decoded_user[:type] != "company"

        hh = HeadHunter.find head_hunter_id
        raise ActiveRecord::RecordNotFound if hh.nil?

        if @decoded_user[:type] == "company"
            prev = CompaniesHeadHunter.where(company_id: @decoded_user[:id], head_hunter_id: head_hunter_id).last
            puts prev
            raise ActiveRecord::RecordInvalid if !prev.nil?

            company = Company.find @decoded_user[:id]

            raise ActiveRecord::RecordNotFound if company.nil?
            company.head_hunters << hh
        else
            prev = HeadHuntersUser.where(user_id: @decoded_user[:id], head_hunter_id: head_hunter_id).last
---
SELECT  "head_hunters".* FROM "head_hunters" WHERE "head_hunters"."id" = 1 LIMIT 1
SELECT  "companies_head_hunters".* FROM "companies_head_hunters" WHERE "companies_head_hunters"."company_id" IS NULL AND "companies_head_hunters"."head_hunter_id" = 1 ORDER BY "companies_head_hunters"."id" DESC LIMIT 1
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1
INSERT INTO "companies_head_hunters" ("head_hunter_id", "company_id", "created_at", "updated_at") VALUES (1, 1, '2020-05-24 05:12:19.989308', '2020-05-24 05:12:19.989308') RETURNING "id"
SELECT  "head_hunters_users".* FROM "head_hunters_users" WHERE "head_hunters_users"."user_id" = 1 AND "head_hunters_users"."head_hunter_id" = 2 ORDER BY "head_hunters_users"."id" DESC LIMIT 1

    def confirm_head_hunter
        request = params.require(:assignment).permit(:user_type, :id)
        raise AppException::InvalidRole if @decoded_user[:type] != "headhunter"

        if request[:user_type] == "company"
            relationship = CompaniesHeadHunter.where(company_id: request[:id], head_hunter_id: @decoded_user[:id]).last
        elsif request[:user_type] == "user"
            relationship = HeadHuntersUser.where(user_id: request[:id], head_hunter_id: @decoded_user[:id]).last
---
SELECT  "companies_head_hunters".* FROM "companies_head_hunters" WHERE "companies_head_hunters"."company_id" IS NULL AND "companies_head_hunters"."head_hunter_id" = 1 ORDER BY "companies_head_hunters"."id" DESC LIMIT 1
SELECT  "head_hunters_users".* FROM "head_hunters_users" WHERE "head_hunters_users"."user_id" = 1 AND "head_hunters_users"."head_hunter_id" = 1 ORDER BY "head_hunters_users"."id" DESC LIMIT 1