users-ms/users-ms/app/controllers/authentication_controller.rb

SELECT  "head_hunters".* FROM "head_hunters" WHERE "head_hunters"."username" = 'fabiostovarr' LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."username" = 'fabiostovarr' LIMIT 1
SELECT  "companies".* FROM "companies" WHERE "companies"."username" = 'fabiostovarr' LIMIT 1
---
    def validate_user
        username = params.require :username

        user = HeadHunter.find_by username: username
        user = User.find_by username: username if user.nil?
        user = Company.find_by username: username if user.nil?

SELECT  "users".* FROM "users" WHERE "users"."username" = 'fabiostovarr' LIMIT 1
SELECT  "head_hunters".* FROM "head_hunters" WHERE "head_hunters"."username" = 'fabiostovarr' LIMIT 1
SELECT  "companies".* FROM "companies" WHERE "companies"."username" = 'company' LIMIT 1
---
    def login
        user_params = params.require(:user).permit(:username, :type, :password, :email)

        case user_params[:type]
        when "user"
            user = User.find_by username: user_params[:username]
        when "headhunter"
            user = HeadHunter.find_by username: user_params[:username]
        when "company"
            user = Company.find_by username: user_params[:username]