users-ms/users-ms/app/controllers/companies_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1
---
  def head_hunters
    u = Company.find @decoded_user[:id]