users-ms/users-ms/app/controllers/head_hunters_controller.rb

  def companies
    u = HeadHunter.find @decoded_user[:id]
---
SELECT  "head_hunters".* FROM "head_hunters" WHERE "head_hunters"."id" = 1 LIMIT 1

  def users
    u = HeadHunter.find @decoded_user[:id]
---
SELECT  "head_hunters".* FROM "head_hunters" WHERE "head_hunters"."id" = 1 LIMIT 1

    def set_head_hunter
      @head_hunter = HeadHunter.find_by username: params[:id]
---
SELECT  "head_hunters".* FROM "head_hunters" WHERE "head_hunters"."username" = 'users' LIMIT 1