users-ms/users-ms/app/controllers/users_controller.rb

  def head_hunters
    u = User.find @decoded_user[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1

  def create
    @user = User.new user_params

    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "username", "created_at", "updated_at") VALUES ('Fabio Tovar', 'fabiostovarr@gmail.com', '$2a$12$SQceupiPHl/JZOmB0s0MeuB7zdlC.4UuBSBfFkHtxrrK4iRVc4DBS', 'fabiostovar', '2020-05-24 12:16:32.754910', '2020-05-24 12:16:32.754910') RETURNING "id"